In [1]:
import pandas as pd

In [3]:
# creating data frame
data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "age": [25, 30, 35, None, 28],
    "city": ["New York", "Paris", "Paris", "London", None]
}

df = pd.DataFrame(data)
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4      Eva  28.0      None

In [62]:
# saving our dataframe (df) as a csv file
df.to_csv("practiceData.csv", index=False)

In [45]:
# exploring data
df.info()
df.head()
df.describe()
df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     4 non-null      float64
 2   city    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

name    0
age     1
city    1
dtype: int64

In [46]:
# Cleaning data

# fill messing ages with mean
df['age'] = df["age"].fillna(df["age"].mean()) # Finds mean and store it to updated dataframe 
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David  29.5    London
4      Eva  28.0      None

In [54]:
# Fill missing city with "Unknown"
df["city"] = df["city"].fillna("Unknown")
df

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David  29.5    London
4      Eva  28.0   Unknown

In [55]:
# filter age greater then 30
df[df['age'] > 30]

      name   age   city
2  Charlie  35.0  Paris

In [57]:
# sort by age
# df.sort_values(by='age')
df.sort_values('age')

      name   age      city
0    Alice  25.0  New York
4      Eva  28.0   Unknown
3    David  29.5    London
1      Bob  30.0     Paris
2  Charlie  35.0     Paris

In [61]:
# Add new column
df["age_category"] = df["age"].apply(lambda x : "Young" if x < 30 else "Adult")
df

      name   age      city  age_catoagry age_category
0    Alice  25.0  New York            22        Young
1      Bob  30.0     Paris            22        Adult
2  Charlie  35.0     Paris            22        Adult
3    David  29.5    London            22        Young
4      Eva  28.0   Unknown            22        Young

In [9]:
# sort values
# df.sort_values("age")
# df.sort_values("city")

      name   age      city
3    David   NaN    London
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
4      Eva  28.0      None

In [18]:
# filter dat
df[df["age"] < 30] # filter data by comparing 
df["age"] < 30

      name   age      city
0    Alice  25.0  New York
1      Bob  30.0     Paris
2  Charlie  35.0     Paris
3    David   NaN    London
4      Eva  28.0      None